app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    @animals = Animal.all

INSERT INTO "animals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Dog"], ["created_at", "2015-08-14 01:49:40.462531"], ["updated_at", "2015-08-14 01:49:40.462531"]]
---
  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_animal
      @animal = Animal.find(params[:id])